Autodesk.Revit.DB.Analysis.ConceptualSurfaceType.GetConstructionTypeIds
The element ids of the ConceptualConstructionType's associated with this ConceptualSurfaceType.
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualSurfaceType.GetAllMassSubCategoryIds
Get all the mass subcategory ids for which there are ConceptualSurfaceType's.
Returns:
Returns an array of element id of mass subcategories for which there are ConceptualSurfaceType's.
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualSurfaceType.GetByMassSubCategoryId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Get the ConceptualSurfaceType by its mass subcategory id.
cda:
The document.
massSubCategoryId:
The mass subcategory id to get the ConceptualSurfaceType for.
Returns:
Returns ConceptualSurfaceType associated with input id or NULL.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The mass sub-category is none of the
OST_MassInteriorWall,
OST_MassExteriorWall,
OST_MassExteriorWallUnderground,
OST_MassRoof,
OST_MassFloor,
OST_MassSlab,
OST_MassShade,
OST_MassGlazing,
OST_MassSkylights,
or OST_MassOpening.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualSurfaceType.DefaultConstructionTypeId
The element id of the user specified ConceptualConstructionType to be used by default on creation for mass faces of this mass subcategory.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input element is not a constructionType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualSurfaceType.MassSubCategoryId
The mass subcategory id of the ConceptualSurfaceType.
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualSurfaceType
This element represents a conceptual BIM object category to assign to faces in Mass geometries.
There is one ConceptualSurfaceType element for each of the Mass Surface Subcategories.
for serialization
Remarks:
When Conceptual Energy Analysis is enabled in Revit Projects, massing faces will be assigned
to the subcategories of Mass category that these ConceptualSurfaceType's are associated with.
A default ConceptualConstructionType is associated with the ConceptualSurfaceType.  This
default ConceptualConstructionType is assigned to Mass faces with the corresponding subcategory.
Changing the default ConceptualConstructionType associated with the ConceptualSurfaceType
will update the ConceptualConstruction type for all Mass faces of that subcategory which the
user has not specifically provided an override value for.
Since:
2012